Autodesk.Revit.DB.Transform1D.TransformParameterDomain(System.Double,System.Double)
Performs a transform of the parameter range defined by domain, and ensures that the domain is ordered correctly.
Remarks:
If the domain is empty it is unchanged.
domainStart:
The original parameter domain start.
domainEnd:
The original parameter domain end.
Since:
2021

Autodesk.Revit.DB.Transform1D.GetInverse
Gets the inverse transformation of this transformation.
Remarks:
The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This transformation is singular.
Since:
2021

Autodesk.Revit.DB.Transform1D.OfVector(System.Double)
Applies the transformation to the 1-dimensional vector (a "tangent vector" on the real line) and returns the result.
Remarks:
Transformation of a vector is not affected by the translational part of the transformation.
vector:
The vector to transform.
Returns:
The transformed vector.
Since:
2021

Autodesk.Revit.DB.Transform1D.OfPoint(System.Double)
Applies the transformation to the 1-dimensional point and returns the result.
Remarks:
Transformation of a point is affected by the translational part of the transformation.
point:
The point to transform.
Returns:
The transformed point.
Since:
2021

Autodesk.Revit.DB.Transform1D.Multiply(Autodesk.Revit.DB.Transform1D)
Multiplies this transformation by the specified transformation and returns the result.
Remarks:
The combined transformation has the same effect as applying the input transformation first, and this transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).
right:
The input transformation.
Returns:
The transformation equal to the composition of the two transformations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform1D.SetToIdentity
Set this TrfUV to the identity transform
Returns:
Returns a pointer to "this" Autodesk.Revit.DB.Transform1D.
Since:
2021

Autodesk.Revit.DB.Transform1D.Assign(Autodesk.Revit.DB.Transform1D)
Assigns values from the input transformation to this transformation.
from:
The transformation to use as input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform1D.AlmostEqual(Autodesk.Revit.DB.Transform1D)
Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Remarks:
The tolerance is applied memberwise for comparison.
right:
The transformation to compare with this transformation.
Returns:
True if the two transformations are equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform1D.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Transform1D.Determinant
The determinant of this transformation.
Since:
2021

Autodesk.Revit.DB.Transform1D.IsIdentity
The boolean value that indicates whether this transformation is an identity.
Remarks:
The identity transformation does not change a point or a vector that it is applied to.
Since:
2021

Autodesk.Revit.DB.Transform1D.Translation
The translational part of this transformation.
Since:
2021

Autodesk.Revit.DB.Transform1D.Scale
The real number that represents the scale of this transformation.
Since:
2021

Autodesk.Revit.DB.Transform1D.#ctor(System.Double)
Constructs the transformation by specifying the scale only.
Remarks:
The translation is set to zero.
1D space is tranformed according to the following formula: t --> scale*t + translation
This constructor sets translation to zero.
scale:
The scale of the transformation.
Since:
2021

Autodesk.Revit.DB.Transform1D.#ctor(System.Double,System.Double)
Constructs the transformation by specifying the scale and the translation.
Remarks:
1D space is tranformed according to the following formula: t --> scale*t + translation
scale:
The scale of the transformation.
translation:
The translational part of the transformation.
Since:
2021

Autodesk.Revit.DB.Transform1D.#ctor(Autodesk.Revit.DB.Transform1D)
The copy constructor.
other:
The transformation to use as input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform1D
An affine transform of 1D Euclidean space.
Remarks:
An affine transform is a linear transform plus a translation (which may be zero).
1D space is tranformed according to the following formula: t -> A*t + B where A and B are constants.
Some functions only accept certain kinds of transform (e.g., rigid motion, conformal, non-singular, etc.).
Since:
2021